In [1]:
import pandas as pd
import requests

In [3]:
visits_data = pd.read_csv('visits_1k.csv')
regs_data = pd.read_csv('regs_1k.csv')

visits_data.describe()

,uuid,platform,user_agent,date
count,1000,1000,1000,1000
unique,519,3,28,996
top,251a0926-ece3-4d77-aa42-ab569fdf9fe2,web,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,2023-03-01T08:01:45
freq,4,954,71,2

In [5]:
regs_data.describe()

            user_id
count  1.000000e+03
mean   4.488623e+06
std    2.620568e+06
min    2.236800e+04
25%    2.235489e+06
50%    4.473044e+06
75%    6.779707e+06
max    8.881772e+06

In [7]:
API_URL = "https://data-charts-api.hexlet.app"
DATE_BEGIN = '2023-03-01'
DATE_END = '2023-09-01'

response = requests.get(f"{API_URL}/visits?begin={DATE_BEGIN}&end={DATE_END}")

data = response.json()
df_visits = pd.DataFrame(data)
df_visits.head()

,datetime,platform,user_agent,visit_id
0,"Wed, 01 Mar 2023 10:36:22 GMT",web,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,1de9ea66-70d3-4a1f-8735-df5ef7697fb9
1,"Wed, 01 Mar 2023 06:25:00 GMT",web,Mozilla/5.0 (Windows NT 10.0; WOW64; Trident/7...,f149f542-e935-4870-9734-6b4501eaf614
2,"Wed, 01 Mar 2023 10:26:13 GMT",web,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11_2...,08f0ebd4-950c-4dd9-8e97-b5bdf073eed1
3,"Wed, 01 Mar 2023 12:33:06 GMT",web,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7...,19322fed-157c-49c6-b16e-2d5cabeb9592
4,"Wed, 01 Mar 2023 01:38:35 GMT",web,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,04762a22-3c9f-40c9-9ac9-6628c4381836

In [8]:
response = requests.get(f"{API_URL}/registrations?begin={DATE_BEGIN}&end={DATE_END}")

data = response.json()
df_registrations = pd.DataFrame(data)
df_registrations.head()

,datetime,email,platform,registration_type,user_id
0,"Wed, 01 Mar 2023 07:40:13 GMT",ebyrd@example.org,web,google,2e0f6bb8-b029-4f45-a786-2b53990d37f1
1,"Wed, 01 Mar 2023 13:14:00 GMT",knightgerald@example.org,web,email,f007f97c-9d8b-48b5-af08-119bb8f6d9b6
2,"Wed, 01 Mar 2023 03:05:50 GMT",cherylthompson@example.com,web,apple,24ff46ae-32b3-4a74-8f27-7cf0b8f32f15
3,"Wed, 01 Mar 2023 00:04:47 GMT",halldavid@example.org,web,email,3e9914e1-5d73-4c23-b25d-b59a3aeb2b60
4,"Wed, 01 Mar 2023 18:31:52 GMT",denise86@example.net,web,google,27f875fc-f8ce-4aeb-8722-0ecb283d0760

#Шаг 3

##Расчет метрик

###Сгруппируйте данные визитов по датам и платформам

In [19]:
response = requests.get(f"{API_URL}/visits?begin={DATE_BEGIN}&end={DATE_END}")
data = response.json()

df_visits = pd.DataFrame(data)

df_visits['datetime'] = pd.to_datetime(df_visits['datetime'])

idx = df_visits.groupby('visit_id')['datetime'].idxmax()

df_filtered_visits = df_visits.loc[idx]

df_filtered_visits = df_filtered_visits[~df_filtered_visits['user_agent'].str.contains('bot', case=False)]

df_filtered_visits['datetime'] = df_filtered_visits['datetime'].dt.strftime('%Y-%m-%d')

df_grouped = df_filtered_visits.groupby(['datetime', 'platform']).size().reset_index(name='visits')

df_grouped.columns = ['date_group', 'platform', 'visits']

df_visit_grouped = df_grouped.sort_values(by='date_group')

df_visit_grouped.head(1000000)

     date_group platform  visits
0    2023-03-01  android      75
1    2023-03-01      ios      22
2    2023-03-01      web     279
3    2023-03-02  android      67
4    2023-03-02      ios      31
..          ...      ...     ...
546  2023-08-30  android      35
548  2023-08-30      web    1227
550  2023-08-31      ios      50
549  2023-08-31  android      57
551  2023-08-31      web     721

[552 rows x 3 columns]

In [21]:
df_visit_grouped.describe(include='all')

        date_group platform       visits
count          552      552   552.000000
unique         184        3          NaN
top     2023-03-01  android          NaN
freq             3      184          NaN
mean           NaN      NaN   251.273551
std            NaN      NaN   309.435871
min            NaN      NaN     7.000000
25%            NaN      NaN    36.000000
50%            NaN      NaN    74.500000
75%            NaN      NaN   473.250000
max            NaN      NaN  1295.000000

###Сгруппируйте также данные регистраций по датам и платформам

In [23]:
response = requests.get(f"{API_URL}/registrations?begin={DATE_BEGIN}&end={DATE_END}")
data = response.json()

df_registrations = pd.DataFrame(data)

df_registrations['date_group'] = pd.to_datetime(df_registrations['datetime']).dt.strftime('%Y-%m-%d')

df_grouped = df_registrations.groupby(['date_group', 'platform']).size().reset_index(name='registrations')

df_registrations_grouped = df_grouped.sort_values(by=['date_group'])

df_registrations_grouped.head(1000000)

     date_group platform  registrations
0    2023-03-01  android             61
1    2023-03-01      ios             18
2    2023-03-01      web              8
3    2023-03-02  android             59
4    2023-03-02      ios             24
..          ...      ...            ...
546  2023-08-30  android             27
548  2023-08-30      web             34
550  2023-08-31      ios             36
549  2023-08-31  android             42
551  2023-08-31      web             46

[552 rows x 3 columns]

In [25]:
df_registrations_grouped.describe(include='all')

        date_group platform  registrations
count          552      552     552.000000
unique         184        3            NaN
top     2023-03-01  android            NaN
freq             3      184            NaN
mean           NaN      NaN      39.557971
std            NaN      NaN      22.078237
min            NaN      NaN       6.000000
25%            NaN      NaN      23.000000
50%            NaN      NaN      34.000000
75%            NaN      NaN      54.000000
max            NaN      NaN     114.000000

###Объедините датайфреймы, сделайте итоговый датафрейм с расчетом конверсии
###Сохраните датафрейм в формате JSON conversion.json

In [28]:
result_df = pd.merge(df_visit_grouped, df_registrations_grouped, on=['date_group', 'platform'], how='outer')

result_df['conversion'] = (result_df['registrations'] / result_df['visits']) * 100

result_df['conversion'] = result_df['conversion'].round(2)

df_conversion = result_df.sort_values(by='date_group')

df_conversion.to_json('conversion.json')

df_conversion.head(1000000)

     date_group platform  visits  registrations  conversion
0    2023-03-01  android      75             61       81.33
1    2023-03-01      ios      22             18       81.82
2    2023-03-01      web     279              8        2.87
3    2023-03-02  android      67             59       88.06
4    2023-03-02      ios      31             24       77.42
..          ...      ...     ...            ...         ...
546  2023-08-30      ios      66             40       60.61
548  2023-08-30      web    1227             34        2.77
550  2023-08-31  android      57             42       73.68
549  2023-08-31      ios      50             36       72.00
551  2023-08-31      web     721             46        6.38

[552 rows x 5 columns]

In [30]:
df_conversion.describe(include='all')

        date_group platform       visits  registrations  conversion
count          552      552   552.000000     552.000000  552.000000
unique         184        3          NaN            NaN         NaN
top     2023-03-01  android          NaN            NaN         NaN
freq             3      184          NaN            NaN         NaN
mean           NaN      NaN   251.273551      39.557971   52.835851
std            NaN      NaN   309.435871      22.078237   34.093892
min            NaN      NaN     7.000000       6.000000    2.250000
25%            NaN      NaN    36.000000      23.000000    7.387500
50%            NaN      NaN    74.500000      34.000000   70.480000
75%            NaN      NaN   473.250000      54.000000   80.680000
max            NaN      NaN  1295.000000     114.000000   96.150000